Revit 2027 API
IndexPoint Constructor
 Constructs the point primitive.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IndexPoint(
	int index
)
Public Sub New (
	index As Integer
)
public:
IndexPoint(
	int index
)
new :
        index : int -> IndexPoint
Parameters
index Int32
 The index of the point's vertex.
See Also
Reference
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace